{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Рефлексия: <br>\n",
    "11.3.6: Верное решение. <br>\n",
    "11.3.7: Есть как будто бы лишний шаг подсчета остатка, так как я не знала о закономерности появления единицы в двоичном представлении числа (что это остаток от деления нечетного числа на 2), хотя можно было догадаться. Плюс циклов два, так как я решила вывести и само число в двоичном представлении."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "12.5.1. Напишите программу, которая заполняет список из 100 элементов случайными числами в диапазоне от 1 до 50, и затем выводит их сумму и среднее."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Список значений:  [1, 18, 46, 32, 9, 39, 29, 45, 15, 2, 12, 4, 33, 31, 7, 47, 37, 23, 29, 13, 23, 48, 50, 8, 40, 4, 29, 25, 33, 14, 23, 50, 49, 33, 44, 19, 43, 44, 11, 44, 2, 15, 30, 27, 14, 29, 14, 14, 35, 50, 23, 20, 13, 37, 44, 44, 17, 32, 43, 34, 37, 30, 9, 38, 47, 49, 24, 30, 10, 47, 22, 14, 11, 34, 23, 41, 43, 50, 37, 48, 12, 20, 27, 15, 1, 8, 12, 18, 46, 27, 5, 30, 35, 30, 20, 42, 26, 41, 45, 7]\n",
      "Сумма элементов списка равна  2754\n",
      "Среднее значение элементов списка равно  27.54\n"
     ]
    }
   ],
   "source": [
    "import random # подключим модуль работы со случайными величинами\n",
    "\n",
    "lst = [] # создадим переменную с пустым списком\n",
    "for i in range(100): # нам нужно 100 элементов\n",
    "    lst.append(random.randint(1, 50)) # выведем последовательность в списке из 100 случайных элементов от 1 до 50\n",
    "print(\"Список значений: \", lst)\n",
    "\n",
    "# вычислим сумму\n",
    "summa = 0\n",
    "for i in range(0, len(lst)): \n",
    "    summa += lst[i]\n",
    "print('Сумма элементов списка равна ', summa)\n",
    "\n",
    "# вычислим среднее\n",
    "mean = summa / 100 # делим сумму на количество элементов списка\n",
    "print('Среднее значение элементов списка равно ', mean)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "12.5.2. Напишите программу, которая находит в массиве введенное с клавиатуры значение и выводит его индекс (номер нахождения в массиве, начиная с нуля). Используйте break, чтобы при нахождении нужного значения не продолжать цикл."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Число для нахождения в списке: 12\n",
      "Индекс числа равен  10\n"
     ]
    }
   ],
   "source": [
    "n = int(input('Число для нахождения в списке: '))\n",
    "\n",
    "for i in range(len(lst)):\n",
    "    if lst[i] == n:\n",
    "        print('Индекс числа равен ', i)\n",
    "        break"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "12.5.3. Напишите программу, которая находит минимальное и максимальное значения в массиве."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Максимальное значение в массиве равно 50\n",
      "Минимальное значение в массиве равно 1\n"
     ]
    }
   ],
   "source": [
    "maximum = 0 # переменная максимального значения\n",
    "minimum = 1 # переменная минимального значения со значением 1, потому что список состоит из рандомных чисел от 1 до 50, а не от 0\n",
    "for i in lst: # пробежимся по индексам всех элементов списка\n",
    "    if maximum < lst[i]: # если наше максимальное значение, изначальное равное нулю, меньше элемента списка,\n",
    "        maximum = lst[i] # обновляем значение максимума до значения этого элемента и на выходе получим максимум\n",
    "    if minimum > lst[i]: # присвоив минимально возможное значение этой переменной, проверяем, есть ли большие, чтобы получить корректный минимум\n",
    "        minimum = lst[i] # если большие есть, обновляем значение минимума\n",
    "print('Максимальное значение в массиве равно', maximum)\n",
    "print('Минимальное значение в массиве равно', minimum)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
