{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Рефлексия: критичных ошибок нет"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "11.3.6. Проверяем гипотезу Коллатца -- простейшую из нерешённых задач математики.\n",
    "Возьмём любое целое неотрицательное число. Если оно чётное, поделите его на два. Если нечётное, умножьте на три и прибавьте один. Утверждается, что если такой цикл повторять достаточно долго, то рано или поздно в результате мы получим единицу.\n",
    "Напишите программу, которая получает на вход целое неотрицательное число, и затем выполняет бесконечный цикл, выполняя над текущим значением вышеприведённые манипуляции. Когда в итоге будет получено значение 1, завершите цикл и выведите количество итераций."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Неотрицательное число: 3\n",
      "Количество итераций равно 7\n"
     ]
    }
   ],
   "source": [
    "n = int(input('Неотрицательное число: '))\n",
    "it = 0 # количество итераций\n",
    "\n",
    "if n < 0: # исключим возможность введения неподходящего числа\n",
    "    print('Введено некорректное число') \n",
    "    \n",
    "while n != 1: # пока n не равно единице,\n",
    "    if n % 2 == 0: # если число четное,\n",
    "        n = n / 2 # делим его на два\n",
    "    else: # в противном случае (если число нечетное),\n",
    "        n = n * 3 + 1 # умножим n на 3 и прибавим 1\n",
    "    it += 1 # прибавим к счетчику итераций единицу\n",
    "    \n",
    "print('Количество итераций равно', it)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "11.3.7.(дополнительное). Определите, сколько единичных разрядов (сколько разрядов с цифрой 1, разряды с цифрой 0 не считаются) в двоичном представлении вводимого числа N. <br>\n",
    "Подсказка: само число переводить в двоичный вид необязательно."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Число для перевода в двоичное представление: 22\n",
      "Число в двоичном представлении равно 10110\n",
      "Количество единичных разрядов числа в двоичном представлении равно 3\n"
     ]
    }
   ],
   "source": [
    "n = int(input('Число для перевода в двоичное представление: '))\n",
    "one = 0 # счетчик единиц\n",
    "x = '' # переменная для записи числа в двоичной системе в формате строки\n",
    "holdn = n # сохраним переменную n для работы со вторым циклом подсчета единиц\n",
    "\n",
    "# Переведем число в двоичную систему\n",
    "while n > 0: # пока n больше нуля,\n",
    "    x = str(n % 2) + x # возьмем остаток от него, преобразуем в строку и запишем в x\n",
    "    n //= 2 # и разделим нацело на 2\n",
    "    \n",
    "while holdn != 1: # пока n не равно 1,\n",
    "    a = holdn // 2 # разделим нацело на 2,\n",
    "    b = holdn - a * 2 # вычтем остаток от деления, умноженный на 2, от изначального числа,\n",
    "    holdn = a # обновим значение n\n",
    "    if a == 1 or b == 1: # если деление нацело или операция от вычитания остатка * 2, равны единице,\n",
    "        one += 1 # прибавим это в счетчик единиц\n",
    "\n",
    "print('Число в двоичном представлении равно', x)\n",
    "print('Количество единичных разрядов числа в двоичном представлении равно', one)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
