{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "8.5. Напишите программу, которая выводит все числа от 0 до 11, кроме чисел 3 и 6."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      "1\n",
      "2\n",
      "4\n",
      "5\n",
      "7\n",
      "8\n",
      "9\n",
      "10\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "for i in range(0, 12):\n",
    "    if i != 3 and i != 6:\n",
    "        print(i)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "8.6. Напишите программу, которая последовательно выводит числа от 1 до 50, но если число нацело делится на три, печатайте \"*333*\", если число делится нацело на пять, печатайте \"*555*\", а если число делится нацело и на три, и на пять, печатайте \"*333*555*\"."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n",
      "2\n",
      "333\n",
      "4\n",
      "555\n",
      "333\n",
      "7\n",
      "8\n",
      "333\n",
      "555\n",
      "11\n",
      "333\n",
      "13\n",
      "14\n",
      "333555\n",
      "16\n",
      "17\n",
      "333\n",
      "19\n",
      "555\n",
      "333\n",
      "22\n",
      "23\n",
      "333\n",
      "555\n",
      "26\n",
      "333\n",
      "28\n",
      "29\n",
      "333555\n",
      "31\n",
      "32\n",
      "333\n",
      "34\n",
      "555\n",
      "333\n",
      "37\n",
      "38\n",
      "333\n",
      "555\n",
      "41\n",
      "333\n",
      "43\n",
      "44\n",
      "333555\n",
      "46\n",
      "47\n",
      "333\n",
      "49\n",
      "555\n"
     ]
    }
   ],
   "source": [
    "for i in range(1, 51):\n",
    "    if i % 3 == 0 and i % 5 == 0: # сначала проверяем условие, удовлетворяющее делению и на 3, и на 5, \n",
    "        print('333555') # иначе условный оператор не будет до него доходить, потому что этb числа на 3 и на 5 тоже отдельно делятся,\n",
    "    elif i % 5 == 0: # так что будет считаться, что условие выполнено\n",
    "        print('555')\n",
    "    elif i % 3 == 0:\n",
    "        print('333')\n",
    "    else:\n",
    "        print(i)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "8.7. Оксана вычитала в астрологическом журнале очередной способ гадания любит/не любит: нумерологический.\n",
    "Надо проверить время (часы, 1-24), на которое парень назначил ей свидание, на чётность. Если результат будет нечётным, значит, не любит!\n",
    "\n",
    "Алгоритм проверки такой: надо просуммировать все натуральные делители числа, исключив 1 и само число.\n",
    "\n",
    "Например, Олег назначил Оксане свидание в 6 утра. 6 делится нацело на 2 и на 3, 2+3=5, нечётно -- не любит!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "18\n",
      "Сумма делителей равна: 20\n",
      "Любит!\n"
     ]
    }
   ],
   "source": [
    "delitel = 0 # введем переменную, куда будем, проходясь по циклу, записывать натуральные делители числа\n",
    "hour = int(input()) # введем переменную для ввода часа\n",
    "summa = 0 # введем переменную для суммы делителей\n",
    "for i in range(1, hour): # берем диапазон до hour, а не hour + 1, чтобы сразу исключить делитель, равный числу\n",
    "    if hour >= 1 and hour <= 24: # зададим диапазон корректных для данной задачи чисел\n",
    "        if hour % i == 0: # получаем натуральный делитель\n",
    "            delitel += 1 # записываем его в переменную\n",
    "            if delitel != 1: # само число мы исключили ранее, задав границы диапазона, осталось исключить делитель, равный 1\n",
    "                summa += i # складываем натуральные делители числа\n",
    "    else:\n",
    "        print('Некорректное число') # выводим на экран в случае, если введено число за пределами данного диапащона\n",
    "        \n",
    "print('Сумма делителей равна:', summa) # выводим сумму натуральных делителей на экран\n",
    "            \n",
    "if summa % 2 == 0: # если сумма делителей получилась четная, выводим на экран, что лююит\n",
    "    print('Любит!')\n",
    "else: # в противном случае выводим, что не любит\n",
    "    print('Не любит!')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Рефлексия: <br>\n",
    "8.1.: Все верно. <br>\n",
    "8.2.: Все верно, так же, как в эталонном решении, только запись немного иная. <br>\n",
    "8.3.: Посчитала среднее в цикле и не формулой деления на (m - n + 1), а просто делением на m, посчитав, что количество слагаемых всегда будет равно последней границе диапазона, так как специфического шага в условии не было, а значит, он по умолчанию равен 1. <br>\n",
    "8.4.: Верно, только в условии я указала, что остаток от деления числа на 2 должен быть не равен нулю, а не то, что он должен быть равен 1. "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
