{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "Skxxi1Frd2nw"
   },
   "source": [
    "Рефлексия: <br>\n",
    "12.5.4.: Сделала двумя способами. Один, с созданием нового списка, в соответствии с комментариями, ошибочен, так как в нем несколько циклов, другой - верный. Просто решила запечатлеть все идеи по решению задачи, которые пришли мне в голову. <br>\n",
    "12.5.5.: Снова есть два способам, первый из которых ошибочен, так как сделан не в циклах, а просто принтом с читерством, а второй - почти верный, только я указала \"старт, стоп, шаг\" иначе, чем в решении сеньора, и стоп у меня не там, где надо: он не захватил последний элемент. Не думаю, что это ошибка, и не понимаю, зачем делить на два длину массива. В целом, если честно, решение сеньора здесь не очень понятно. А, и я записала список в обратном порядке в другую переменную, это тоже ошибка в соответствии с комментариями сеньора. <br>\n",
    "12.5.6.: Все верно."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "sBrIUavrd2ny"
   },
   "source": [
    "12.5.7. Напишите программу, которая печатает элементы, одновременно присутствующие в двух массивах (предварительно заполните их случайными числами). Используйте вложенные циклы."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "qMSwyjcYd2nz",
    "outputId": "3beebb96-5671-4058-d312-ac4aa5b149e6"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Список значений первого списка: [32, 28, 16, 18, 34, 2, 44, 11, 3, 17, 4, 30, 15, 21, 36, 32, 8, 17, 17, 40]\n",
      "Список значений второго списка: [44, 38, 47, 34, 35, 47, 14, 23, 31, 5, 39, 18, 26, 23, 40, 48, 6, 39, 13, 41]\n",
      "Элементы, присутствующие в двух списках:\n",
      "18 34 44 40 "
     ]
    }
   ],
   "source": [
    "import random # подключим модуль работы со случайными величинами\n",
    "\n",
    "lst1 = [] # создадим переменную с пустым списком\n",
    "for i in range(20): # сделаем 20 элементов\n",
    "    lst1.append(random.randint(1, 50)) # выведем последовательность в списке из 20 случайных элементов от 1 до 50\n",
    "print('Список значений первого списка:', lst1)\n",
    "\n",
    "lst2 = [] # создадим переменную с пустым списком\n",
    "for i in range(20): # сделаем 20 элементов\n",
    "    lst2.append(random.randint(1, 50)) # выведем последовательность в списке из 20 случайных элементов от 1 до 50\n",
    "print('Список значений второго списка:', lst2)\n",
    "\n",
    "print('Элементы, присутствующие в двух списках:')\n",
    "for i in range(len(lst1)):\n",
    "    for j in range(len(lst2)):\n",
    "        if lst1[i] == lst2[j]:\n",
    "              print(lst1[i], end = \" \")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "NI147V5ad2nz"
   },
   "source": [
    "12.5.8. Напишите программу, которая сортирует массив из 10 элементов по возрастанию."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "VIDRufvEd2n0",
    "outputId": "cead80bc-6808-4d79-cb4c-4edd90977d3a"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Список значений: [38, 16, 5, 27, 28, 40, 37, 43, 44, 28]\n",
      "Отсортированный список значений: [5, 16, 27, 28, 28, 37, 38, 40, 43, 44]\n"
     ]
    }
   ],
   "source": [
    "import random # подключим модуль работы со случайными величинами\n",
    "\n",
    "lst = [] # создадим переменную с пустым списком\n",
    "for i in range(10): # нам нужно 10 элементов\n",
    "    lst.append(random.randint(1, 50)) # выведем последовательность в списке из 10 случайных элементов от 1 до 50\n",
    "print('Список значений:', lst)\n",
    "\n",
    "for j in range(len(lst) - 1): # вводим переменную j для того, чтобы цикл прошелся по списку столько раз, сколько необходимо, чтобы отсортировались все элементы по возрастанию\n",
    "    for i in range(len(lst) - 1 - j): # бежит по индексам списка на длину меньше длины списка на 1 и на j, чтобы не словить list index out of range\n",
    "        if lst[i] > lst[i + 1]: # если элемент слева больше соседа справа,\n",
    "            lst[i], lst[i + 1] = lst[i + 1], lst[i] # меняем их местами\n",
    "print('Отсортированный список значений:', lst)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "CViNt-4kd2n0"
   },
   "source": [
    "12.5.9. Реализуйте логику метания кубиков из игры Dungeons & Dragons. Логика кубика записывается формулой NdM, где N -- количество кубиков, а M -- количество граней каждого кубика. Например, 3d12 означает бросок трёх двенадцатигранных кубиков. Соответственно, минимально может выпасть 3, а максимально 36. <br>\n",
    "Вам надо вывести результат метания кубика, для которого введены N и M. <br>\n",
    "<i> Не используйте в этой задачке массивы, это задача на случайные значения. </i>\n",
    "\n",
    "Тут надо смоделировать сам процесс: бросаем N раз кубик с M гранями, и суммируем выпавшие значения."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "g5ynv0jnd2n0",
    "outputId": "10a94552-d546-4fcd-f267-db4c5e31a035"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Количество бросков: 2\n",
      "Количество граней одного кубика: 4\n",
      "Результат одного броска: 4\n",
      "Результат одного броска: 1\n",
      "Результат метания кубика: 5\n"
     ]
    }
   ],
   "source": [
    "import random # подключим модуль работы со случайными величинами\n",
    "\n",
    "n = int(input('Количество бросков: '))\n",
    "m = int(input('Количество граней одного кубика: '))\n",
    "sum = 0 # переменная-счетчик для суммы выпавших значений\n",
    "\n",
    "for i in range(n): # запускаем цикл по количеству бросков\n",
    "    a = random.randint(1, m) # зададим границы возможного значения переменной а от единицы до m\n",
    "    print('Результат одного броска:', a)\n",
    "    sum += a # суммируем все выпавшие значения а и получим результат бросания кубиков\n",
    "print('Результат метания кубика:', sum)"
   ]
  }
 ],
 "metadata": {
  "colab": {
   "collapsed_sections": [],
   "name": "Zanyatie_12_chast_3.ipynb",
   "provenance": []
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
