{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "9.3.1. Напишите программу, которая подсчитывает и выводит количество чисел между 100 и 400, которые нацело делятся на 7."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "43\n"
     ]
    }
   ],
   "source": [
    "count = 0\n",
    "for i in range(100, 401):\n",
    "    if i % 7 == 0:\n",
    "        count += 1\n",
    "print(count)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "9.3.2. Хакер сканирует роутеры Cisco на наличие уязвимости CVE-2018-0171. Как только такая уязвимость будет обнаружена, он грузит в корпоративную сеть свой руткит -- профит!\n",
    "Ваша программа-сканер получает на вход число -- количество роутеров. Далее она вводит коды уязвимостей (целые числа), и если код равен 171, программа должна завершиться и вывести порядковый номер роутера, начиная с 1. Если уязвимостей не найдено, надо проинформировать об этом.\n",
    "\n",
    "Например, на входе будут числа\n",
    "3 128 171 256\n",
    "\n",
    "Программа должна вывести сообщение в духе \"2-й роутер уязвим\".\n",
    "\n",
    "Подсказка: сперва например вводим в N кол-во роутеров, и затем делаем цикл до N, где внутри цикла вводим очередной код в переменную X и обрабатываем его. Сколько будет вводиться значений, программе заранее неизвестно, но тут достаточно всегда одной переменной X, которая хранит очередной введённый код. Ну и дополнительные переменные для логики задачки понадобятся."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n",
      "12\n",
      "171\n",
      "2 роутер уязвим\n"
     ]
    }
   ],
   "source": [
    "n = int(input()) #количество роутеров\n",
    "for i in range(n):\n",
    "    x = int(input())\n",
    "    if i == n-1 and x != 171:\n",
    "        print('Уязвимостей не обнаружено')\n",
    "    if x == 171:\n",
    "        print(i+1, 'роутер уязвим')\n",
    "        break"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Рефлексия: <br>\n",
    "8.8.: Решено верно, но я думала, что еще нельзя использовать метод множественного присваивания, поэтому решила через дополнительную, четвертую, переменную, временно сохраняя туда данные. <br>\n",
    "8.9.: Все верно."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
