{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "8.8. Оксана поливает на подоконнике герань, фиалки и кактус. Каждый день она меняет местами правый и центральный горшки, чтобы они равномернее получали солнечные лучи. А Олег вечером переставляет центральный и левый горшочки.\n",
    "\n",
    "Напишите программу, которая выведет порядок цветков на подоконнике через N дней.\n",
    "Смоделируйте сам процесс перестановок, чтобы внутренние переменные (горшочки) в программе хранили новый порядок."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n",
      "кактус герань фиалка\n"
     ]
    }
   ],
   "source": [
    "days_num = int(input()) # переменная для кол-ва дней\n",
    "# изначальная расстановка цветов\n",
    "left = 'герань'\n",
    "center = 'фиалка'\n",
    "right = 'кактус'\n",
    "extra = 0 # доп. переменная для того, чтобы временно в нее класть значения других переменных, чтобы поменять местами\n",
    "\n",
    "# пишем цикл для нужного количества дней\n",
    "for i in range(1, days_num + 1):\n",
    "    # действия Оксаны: смена мест правого и центрального\n",
    "    extra = center # кладем в доп.переменную значение центра\n",
    "    center = right # меняем местами центр и право\n",
    "    right = extra # кладем значение правого в доп.переменную\n",
    "    # действия Олега: смена мест центрального и левого\n",
    "    extra = center # доп.переменная, равная правому, становится центром\n",
    "    center = left # центр меняется местами с левым\n",
    "    left = extra # левый записывается в доп.\n",
    "\n",
    "print(left, center, right) # выводим результат"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "8.9. Вечная классика программирования -- факториал (в математике записывается как !).\n",
    "\n",
    "Факториал -- это для числа N произведение всех чисел от 1 до N.\n",
    "\n",
    "Например,\n",
    "5! = 1*2*3*4*5 = 120\n",
    "\n",
    "Напишите программу, вычисляющую факториал числа."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n",
      "Факториал числа 10 равен 3628800\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "x = 1\n",
    "for i in range(1, n + 1):\n",
    "    x *= i\n",
    "print('Факториал числа', n, 'равен', x)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Рефлексия: <br>\n",
    "8.5.: Все верно. <br>\n",
    "8.6.: Все верно. <br>\n",
    "8.7.: Выводила некоторые промежуточные решени (в частности, сумму делителей), также не в том месте написала условие для вывода \"Некорректное число\", из-за чего это выводилось бы столько раз, сколько цикл проходится. Решение не оптимально, много вложенных ифов и лишних движений. Не могу пока мыслить компактно и выдавать изящные решения."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
