{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Рефлексия:\n",
    "\n",
    "12.5.7: Нужно было при создании двух списков поместить их в один цикл, а не делать два. Само решение верное. <br>\n",
    "12.5.8: Использовала иной алгоритм сортировки, не использовала признак True/False для выявления, упорядочились ли элементы, но результат получился верным, так что, думаю, что решение верное. <br>\n",
    "12.5.9: Я не использовала в решении массив, как и было сказано, но реализовала решение с помощью цикла for in, а не while. Комментария ментора, что что-то из этого является ошибкой, не было, так что считаю решение верным."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "13.4.1. Напишите программу, которая с помощью вложенных циклов вводит с клавиатуры матрицу переменного размера (размер также вводится с клавиатуры)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Количество строк: 3\n",
      "Количество столбцов: 3\n",
      "Матрица переменного размера: [[9, 1, 6], [7, 8, 4], [2, 7, 5]]\n"
     ]
    }
   ],
   "source": [
    "import random # импортируем библиотеку для работы со случайными числовыми значениями\n",
    "\n",
    "n = int(input('Количество строк: ')) \n",
    "m = int(input('Количество столбцов: ')) \n",
    "\n",
    "lst = [] # основной список\n",
    "for i in range(n): # цикл по строкам \n",
    "    lst2 = [] # вложенный подсписок\n",
    "    for j in range(m): # цикл по столбцам\n",
    "        lst2.append(random.randint(1, 9)) # заполняем подсписок значениями от 1 до 9\n",
    "    lst.append(lst2) # добавляем в основной список новый подсписок\n",
    "\n",
    "print('Матрица переменного размера:', lst)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "13.4.2. Напишите программу, которая проверяет, равны ли два трёхмерных массива. Сначала сравните их размеры по каждому измерению, и только если они совпадают, сравните массивы по значениям. <br>\n",
    "<i> Когда будет выяснено, что массивы не равны, полностью прервите дальнейшие расчёты. В заключение, за пределами всех циклов, выводите сообщение, равны массивы или нет. </i> <br>\n",
    "Подразумевается, что \"внутри\" каждого измерения все элементы массива одинаковой длины. То есть в таблице не может быть строк или столбцов разной длины: массивы -- всегда \"правильные\" кубы."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Первый список: [[6, 9, 2], [9, 4, 2], [7, 4, 4]]\n",
      "Второй список: [[9, 9, 6], [5, 4, 5], [5, 9, 7]]\n",
      "Списки равны по длине\n",
      "Списки равны по размеру подсписков\n",
      "Массивы не равны по значениям\n"
     ]
    }
   ],
   "source": [
    "import random # импортируем библиотеку для работы со случайными числовыми значениями\n",
    "\n",
    "# формируем два трехмерных массива\n",
    "lst1 = [] # первый\n",
    "lst2 = [] # второй\n",
    "for i in range(3): \n",
    "    lst3 = [] # вложенный подсписок для первого основного\n",
    "    lst4 = [] # вложенный подсписок для второго основного\n",
    "    for j in range(3):\n",
    "        # заполняем их значениями\n",
    "        lst3.append(random.randint(1, 9))\n",
    "        lst4.append(random.randint(1, 9))\n",
    "    # и заполняем основные списки\n",
    "    lst1.append(lst3) \n",
    "    lst2.append(lst4)\n",
    "\n",
    "print('Первый список:', lst1)\n",
    "print('Второй список:', lst2)\n",
    "\n",
    "# Сравним длины списков\n",
    "if len(lst1) == len(lst2):\n",
    "    flag = True\n",
    "else:\n",
    "    flag = False\n",
    "if flag:\n",
    "    print('Списки равны по длине')\n",
    "else:\n",
    "    print('Списки не равны по длине')\n",
    "\n",
    "# Сравним длины подсписков\n",
    "flag = True\n",
    "for i in range(len(lst1)):\n",
    "    for j in range(len(lst2)):\n",
    "        if len(lst1[i]) != len(lst2[j]):\n",
    "            flag = False\n",
    "            break\n",
    "        \n",
    "if flag:\n",
    "    print('Списки равны по размеру подсписков')\n",
    "else:\n",
    "    print('Списки не равны по размеру подсписков')\n",
    "    \n",
    "# Сравним равенство значений в списках\n",
    "for i in range(3):\n",
    "    for j in range(3):\n",
    "        if lst1[i][j] == lst2[i][j]:\n",
    "            flag = True\n",
    "        else:\n",
    "            flag = False\n",
    "if flag:\n",
    "    print('Массивы равны по значениям')\n",
    "else:\n",
    "    print('Массивы не равны по значениям')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
