{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "Z3htgEL3FyDE"
   },
   "source": [
    "Рефлексия: <br>\n",
    "14.4.1: Не проверила условие, если первый символ строки не пробел. В остальном решение не такое, как у ментора, я вводила переменную-флаг, но оно работает корректно, так что критических ошибок больше не обнаружено. <br>\n",
    "14.4.2: Главная ошибка - есть брейк и вывод в цикле. Я также использовала == и !=, но потому что я думала, что нельзя только сравнивать строки в целом, а отдельные элементы можно. Несмотря на это, мое решение работает. <br>\n",
    "14.4.3: Все верно, только s2 я добавляла в самом цикле. В комментарии не сказано, что это ошибка, так что считаю, что решение корректно. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "8Rbiied9FyDJ"
   },
   "source": [
    "14.4.4. Запишите в переменную, содержащую строку, её саму, перевёрнутую от конца к началу."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "id": "NWSdlLRVFyDK",
    "outputId": "4467a0bb-b3d8-4781-bcf8-73f6c705d1a0"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Я шагаю по Москве\n",
      "евксоМ оп юагаш Я\n"
     ]
    }
   ],
   "source": [
    "s = input('') # создадим строку\n",
    "lst = list(s) # конвертируем ее в список для доступа к отдельным элементам\n",
    "\n",
    "for i in range(len(s) // 2): # делим длину строки, чтобы операция смены мест каждой пары элементов произошла только один раз\n",
    "        a = lst[i] # создадим временную переменную для хранения элемента списка\n",
    "        lst[i] = lst[len(s) - i - 1] # теперь переносим последний элемент исходной строки в начало\n",
    "        lst[len(s) - i - 1] = a # меняем местами первый и последний элементы, а потом симметрично 2 с начала и 2 с конца и т.д.\n",
    "        s2 = ''.join(lst) # добавляем в новую переменную строку, но уже с первым элементом в конце, а последним в начале и т.д.\n",
    "        s = s2\n",
    "print(s)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "VG6w3iBjFyDM"
   },
   "source": [
    "14.4.5. Введите с клавиатуры две строки, и создайте третью строку, которая будет равна сумме двух этих строк (двум строкам, сцепленным друг за другом). Не используйте стандартную операцию сцепления строк \"+\"."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "id": "BpYkUbMpFyDN",
    "outputId": "a13a3bad-eaba-40ee-b6bf-727be1736735",
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "зачем\n",
      "пробел\n",
      "зачемпробел\n"
     ]
    }
   ],
   "source": [
    "# создадим строки\n",
    "s1 = input('')\n",
    "s2 = input('')\n",
    "# преобразуем их в списки\n",
    "lst1 = list(s1)\n",
    "lst2 = list(s2)\n",
    "# введем переменную-список для записи в нее элементов\n",
    "sum_strings = []\n",
    "\n",
    "# положим в эту переменную все элементы, пройдясь по двум спискам\n",
    "for i in range(len(lst1)):\n",
    "    sum_strings.append(lst1[i])\n",
    "\n",
    "for i in range(len(lst2)):\n",
    "    sum_strings.append(lst2[i])\n",
    "\n",
    "# преобразуем ее в строку\n",
    "s3 = ''.join(sum_strings)\n",
    "print(s3)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "kDhd1rNXFyDO"
   },
   "source": [
    "14.4.6. Напишите программу, которая выделяет из строки подстроку -- начиная с заданной позиции и заданной длины, и формирует из неё отдельную строку.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "OcCqng7zFyDO",
    "outputId": "68e55487-3205-497b-ca0e-f95a2075bac8"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите строку: А роза упала на лапу Азора\n",
      "Введите значение позиции: 3\n",
      "Введите значение длины подстроки: 10\n",
      "роза упала\n"
     ]
    }
   ],
   "source": [
    "# Введем необходимые переменные\n",
    "s = input('Введите строку: ')\n",
    "position = int(input('Введите значение позиции: '))\n",
    "length = int(input('Введите значение длины подстроки: '))\n",
    "# Конвертируем строку в список для работы с отдельными элементами\n",
    "lst = list(s)\n",
    "# создадим переменную для списка-новой подстроки\n",
    "lst2 = []\n",
    "\n",
    "# защита от дурака: если пользователь вводит пустую строку либо отрицательное значение позиции или длины подстроки;\n",
    "# также если сумма позиции минус 1 (то есть индекса первого элемента) и длины строки больше длины строки, \n",
    "# то выводится сообщение о невозможности выполнить операцию\n",
    "if len(lst) < 1 or position < 1 or length < 1 or position > len(lst) or length > len(lst) or position - 1 + length > len(lst):\n",
    "    print('Невозможно выполнить операцию со строкой')\n",
    "#  в ином случае, если все нормально, то идем по списку в границах от позиции минус 1(индекс первого элемента)\n",
    "# до длины подстроки плюс значение первого индекса (чтобы код работал исправно вне зависимости от заданных координат)\n",
    "else:\n",
    "    for i in range(position - 1, length + position -1):\n",
    "        lst2.append(lst[i]) # добавляем элементы в новый список\n",
    "        s2 = ''.join(lst2) # конвертируем список в новую строку\n",
    "    print(s2)\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "colab": {
   "collapsed_sections": [],
   "name": "Zanyatie_14_chast_2.ipynb",
   "provenance": []
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
