{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Рефлексия: <br>\n",
    "13.4.3: Сложила матрицы верно, неверным способом сделала это в виде таблицы - забыла, что можно на шаг влево в цикле написать пустой принт и начнется следующая строка. <br>\n",
    "13.4.4: Допустила ту самую очень частую ошибку, теперь поняла ее и оценила изящество менторского решения). "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "13.4.5. Напишите программу, которая рассчитывает сумму элементов каждой строки и каждого столбца матрицы, затем складывает эти суммы по горизонтали и вертикали, и проверяет, что две итоговые суммы равны (проверка бухгалтерского баланса). <br>\n",
    "<i> Заводим два дополнительных массива, в первый записываем значение сумм по каждой строке, во второй -- значение сумм по каждому столбцу. Выводим эти одномерные массивы, и в заключение суммируем их и проверяем две суммы на равенство.\n",
    "Исходный массив делаем таким, что количество строк и столбцов разное. \n",
    "Длины всех строк и длины всех столбцов считаем одинаковыми (то есть матрица -- ровный прямоугольник). <i> "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Сумма строк: [36, 14]\n",
      "Сумма столбцов: [4, 6, 10, 30]\n",
      "Сумма строк: 50 сумма столбцов: 50\n",
      "Суммы строк и столбцов равны\n"
     ]
    }
   ],
   "source": [
    "matrix = [[1, 2, 4, 29], # создаем матрицу с разным количеством строк и столбцов\n",
    "[3, 4, 6, 1]]\n",
    "\n",
    "sum_strings = [] # массив для суммы элементов строк\n",
    "sum_columns = [] # массив для суммы элементов столбцов\n",
    "\n",
    "# посчитаем сумму элементов строк\n",
    "for i in range(len(matrix)): # индекс подсписка\n",
    "    strings = 0 # переменная для хранения суммы строк\n",
    "    for j in range(len(matrix[0])): # индекс элемента подсписка, указываем, что идем с первого элемента и указываем на кол-во строк\n",
    "        strings += matrix[i][j] # складываем элементы, записываем в переменную\n",
    "    sum_strings.append(strings) # добавляем ее в массив для суммы элементов строк\n",
    "        \n",
    "print('Сумма строк:', sum_strings)\n",
    "\n",
    "# посчитаем сумму элементов столбцов\n",
    "for i in range(len(matrix[0])): # начинаем с первого столбца\n",
    "    columns = 0 # переменная для хранения суммы столбцов\n",
    "    for j in range(len(matrix)): # идем по количеству столбцов\n",
    "        columns += matrix[j][i] # складываем элементы, записываем в переменную\n",
    "    sum_columns.append(columns) # добавляем ее в массив для суммы элементов столбцов\n",
    "    \n",
    "print('Сумма столбцов:',sum_columns)\n",
    "\n",
    "# Суммируем получившиеся массивы с суммами строк и столбцов по горизонтали и вертикали\n",
    "sum_horizon_strings = 0 # переменная суммы строк по горизонтали\n",
    "sum_horizon_columns = 0 # переменная суммы столбцов по горизонтали\n",
    "\n",
    "# по горизонтали сумма строк\n",
    "for i in sum_strings:\n",
    "    sum_horizon_strings += i\n",
    "\n",
    "# по горизонтали сумма столбцов\n",
    "for i in sum_columns:\n",
    "    sum_horizon_columns += i\n",
    "    \n",
    "print('Сумма строк:', sum_horizon_strings, 'сумма столбцов:', sum_horizon_columns)\n",
    "\n",
    "# проверяем на равенство\n",
    "if sum_horizon_strings == sum_horizon_columns:\n",
    "    print('Суммы строк и столбцов равны')\n",
    "else:\n",
    "    print('Суммы строк и столбцов не равны')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "13.4.6. Напишите программу, которая транспонирует массив (когда строки становятся столбцами, а столбцы строками).<br>\n",
    "<i> Исходный массив делаем таким, что количество строк и столбцов разное.</i> <br>\n",
    "Результат записывайте, конечно, во второй массив нужной размерности."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Транспортированная матрица: [[1, 3], [2, 4], [4, 6], [29, 1]]\n"
     ]
    }
   ],
   "source": [
    "matrix = [[1, 2, 4, 29], # создаем матрицу с разным количеством строк и столбцов\n",
    "[3, 4, 6, 1]]\n",
    "\n",
    "new_matrix = [] # создаем новый массив для записи результата\n",
    "for i in range(len(matrix[0])): # идем по первому подсписку матрицы (итерируемся по строке)\n",
    "    string = [] # создаем промежуточную переменную для хранения каждого столбца исходной матрицы, который становится строкой\n",
    "    for j in range(len(matrix)): # переменная для элементов подсписков исходной матрицы (итерируемся по столбцу)\n",
    "        string.append(matrix[j][i]) # переворачиваем, как нам нужно\n",
    "    new_matrix.append(string) # записываем в матрицу для записи результата\n",
    "\n",
    "print('Транспортированная матрица:', new_matrix)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
